"""Напишите рекурсивную функцию sum(a, b), возвращающую сумму двух целых неотрицательных чисел. Из всех арифметических операций допускаются только +1 и -1. Также нельзя использовать циклы.

Функция не должна ничего выводить, только возвращать значение.

Пример:


sum(2, 2)
# 4
"""


def sum (a, b):
    if a == 0 and b == 0:
        return 0
    elif a == 0 and b != 0:
        return b
    elif b == 0 and a != 0:
        return a
    return 1 + 1 + (sum (a - 1, b - 1))


print(sum (8, 3))

"""

def sum(a, b):
    if b == 0:
        return a
    elif a == 0:
        return b
    else:
        return sum(a + 1, b - 1)
print(sum (8, 3))
"""